In [10]:
import pandas as pd
data = [
    {
        "name": "zhangsan",
        "age": "14",
        "sex": "boy",
    },
    {
        "name": "lisi",
        "age": "15",
        "sex": "girls"
    },
    {
        "name": "wangwu",
        "age": "14",
        "sex": "girls"    
    }
]
df = pd.DataFrame(data=data)
df

       name age    sex
0  zhangsan  14    boy
1      lisi  15  girls
2    wangwu  14  girls

In [11]:
"""输出df的所有列名"""
df.columns

Index(['name', 'age', 'sex'], dtype='object')

In [12]:
"""修改列名"""
df.rename(columns={"name":"title"}, inplace=True)
df

      title age    sex
0  zhangsan  14    boy
1      lisi  15  girls
2    wangwu  14  girls

In [13]:
"""统计某一列某个数据出现的次数"""
df["age"].value_counts()

14    2
15    1
Name: age, dtype: int64